Tekla Open API Reference for Tekla Structures 2025
BasePoint.ConvertToBasePoint Method
Overload List
Name | Description
ConvertToBasePoint(Point)
 Converts the given local point to this base point.
ConvertToBasePoint(BasePoint, Point)
 Converts the given local point to given base point.
Top
See Also
Reference
BasePoint Class
Tekla.Structures.Model Namespace